---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhase
source: html/dc3fb2a6-d39e-3b80-3506-550de98945a9.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType.ElectricalPhase Property

Get or set electrical phase (single, triple or undefined) of distribution system.

## Syntax (C#)
```csharp
public ElectricalPhase ElectricalPhase { get; set; }
```